bivex/ArchC/tests/esp32c3/esp32c3_arch_ref.H
/******************************************************
 * ArchC Resources header file.                       *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#ifndef  _ESP32C3_ARCH_REF_H
#define  _ESP32C3_ARCH_REF_H

#include  "esp32c3_parms.H"
#include  "ac_arch_ref.H"
#include  "ac_memport.H"
#include  "ac_reg.H"
#include  "ac_regbank.H"


//!Forward class declaration, needed to compile.
class esp32c3_arch;

//!ArchC class for model-specific architectural resources.
class esp32c3_arch_ref : public ac_arch_ref<esp32c3_parms::ac_word, esp32c3_parms::ac_Hword> {
public:
 
  //!Program Counter.
  ac_reg<unsigned>& ac_pc;

  //!Processor Id.
  ac_reg<unsigned>& ac_id;

  //!Storage Devices.
  ac_memport<esp32c3_parms::ac_word, esp32c3_parms::ac_Hword>& IROM;
  ac_memport<esp32c3_parms::ac_word, esp32c3_parms::ac_Hword>& IRAM;
  ac_memport<esp32c3_parms::ac_word, esp32c3_parms::ac_Hword>& DRAM;
  ac_memport<esp32c3_parms::ac_word, esp32c3_parms::ac_Hword>& DM;
  ac_regbank<32, esp32c3_parms::ac_word, esp32c3_parms::ac_Dword>& RB;
  ac_reg<esp32c3_parms::ac_word>& mstatus;
  ac_reg<esp32c3_parms::ac_word>& mie;
  ac_reg<esp32c3_parms::ac_word>& mtvec;
  ac_reg<esp32c3_parms::ac_word>& mepc;
  ac_reg<esp32c3_parms::ac_word>& mcause;

  //!Constructor.
   esp32c3_arch_ref(esp32c3_arch& arch);

};

#endif  //_ESP32C3_ARCH_REF_H
